PARTICIPANT_COLOR = "#997799"
BRONZE_COLOR = "#cd7f32"
SILVER_COLOR = "#b0b7c6"
GOLD_COLOR = "#ffd700"

export default ACHIEVES = 
    "unknown": 
        text: "???"
        title: "???"
        color: "#ff0000"
        score: 100000

    "olymp:participant":
        text: "ол"
        title: "Участник какой-либо олимпиады по информатике, проводимой по разумным правилам"
        color: PARTICIPANT_COLOR
        score: 10

    "mun:participant":
        text: "мун"
        title: "Участник муниципального (районного) этапа Всероссийской олимпиады по информатике"
        color: PARTICIPANT_COLOR
        score: 20

    "koshp:participant":
        text: "нкошп"
        title: "Участник нижегородской командной олимпиады школьников по программированию"
        color: PARTICIPANT_COLOR
        score: 30
    "koshp:3":
        text: "нкошп"
        title: "3 диплом на нижегородской командной олимпиаде школьников по программированию"
        color: BRONZE_COLOR
        score: 50
    "koshp:2":
        text: "нкошп"
        title: "2 диплом на нижегородской командной олимпиаде школьников по программированию"
        color: SILVER_COLOR
        score: 80
    "koshp:1":
        text: "нкошп"
        title: "1 диплом на нижегородской командной олимпиаде школьников по программированию"
        color: GOLD_COLOR
        score: 160

    "nnoi:participant":
        text: "ннои"
        title: "Участник Нижегородской городской олимпиады школьников по информатике им. В. Д. Лелюха"
        color: PARTICIPANT_COLOR
        score: 40
    "nnoi:3":
        text: "ннои"
        title: "3 диплом на Нижегородской городской олимпиаде школьников по информатике им. В. Д. Лелюха"
        color: BRONZE_COLOR
        score: 70
    "nnoi:2":
        text: "ннои"
        title: "2 диплом на Нижегородской городской олимпиаде школьников по информатике им. В. Д. Лелюха"
        color: SILVER_COLOR
        score: 90
    "nnoi:1":
        text: "ннои"
        title: "1 диплом на Нижегородской городской олимпиаде школьников по информатике им. В. Д. Лелюха"
        color: GOLD_COLOR
        score: 170
    "nnoi:bronze":
        text: "🥉ннои"
        title: "Бронзовая медаль на Нижегородской городской олимпиаде школьников по информатике им. В. Д. Лелюха"
        color: BRONZE_COLOR
        score: 150
    "nnoi:silver":
        text: "🥈ннои"
        title: "Серебряная медаль на Нижегородской городской олимпиаде школьников по информатике им. В. Д. Лелюха"
        color: SILVER_COLOR
        score: 190
    "nnoi:win":
        text: "🏆ннои"
        title: "Абсолютный победитель Нижегородской городской олимпиады школьников по информатике им. В. Д. Лелюха"
        color: GOLD_COLOR
        score: 230

    "reg:participant":
        text: "рег"
        title: "Участник регионального (областного) этапа Всероссийской олимпиады школьников по информатике"
        color: PARTICIPANT_COLOR
        score: 60
    "reg:300":
        text: "рег"
        title: "Минимум 300 баллов на региональном (областном) этапе Всероссийской олимпиады школьников по информатике"
        color: BRONZE_COLOR
        score: 110
    "reg:priz":
        text: "рег"
        title: "Призер регионального (областного) этапа Всероссийской олимпиады школьников по информатике"
        color: SILVER_COLOR
        score: 130
    "reg:pob":
        text: "рег"
        title: "Победитель регионального (областного) этапа Всероссийской олимпиады школьников по информатике"
        color: GOLD_COLOR
        score: 200

    "vkoshp:participant":
        text: "вкошп"
        title: "Участник Всероссийской командной олимпиады школьников по программированию"
        color: PARTICIPANT_COLOR
        score: 100
    "vkoshp:3":
        text: "вкошп"
        title: "3 диплом на Всероссийской командной олимпиаде школьников по программированию"
        color: BRONZE_COLOR
        score: 120
    "vkoshp:2":
        text: "вкошп"
        title: "2 диплом на Всероссийской командной олимпиаде школьников по программированию"
        color: SILVER_COLOR
        score: 140
    "vkoshp:1":
        text: "вкошп"
        title: "1 диплом на Всероссийской командной олимпиаде школьников по программированию"
        color: GOLD_COLOR
        score: 210
    "vkoshp:bronze":
        text: "🥉вкошп"
        title: "Бронзовая медаль на Всероссийской командной олимпиаде школьников по программированию"
        color: BRONZE_COLOR
        score: 220
    "vkoshp:silver":
        text: "🥈вкошп"
        title: "Серебряная медаль на Всероссийской командной олимпиаде школьников по программированию"
        color: SILVER_COLOR
        score: 250
    "vkoshp:gold":
        text: "🥇вкошп"
        title: "Золотая медаль на Всероссийской командной олимпиаде школьников по программированию"
        color: GOLD_COLOR
        score: 280
    "vkoshp:win":
        text: "🏆вкошп"
        title: "Абсолютный победитель Всероссийской командной олимпиады школьников по программированию"
        color: GOLD_COLOR
        score: 320

    "roi:participant":
        text: "рои"
        title: "Участник заключительного этапа Всероссийской олимпиады школьников по информатике"
        color: PARTICIPANT_COLOR
        score: 180
    "roi:priz":
        text: "рои"
        title: "Призер заключительного этапа Всероссийской олимпиады школьников по информатике"
        color: SILVER_COLOR
        score: 240
    "roi:pob":
        text: "рои"
        title: "Победитель заключительного этапа Всероссийской олимпиады школьников по информатике"
        color: GOLD_COLOR
        score: 260
    "roi:win":
        text: "🏆рои"
        title: "Абсолютный победитель заключительного этапа Всероссийской олимпиады школьников по информатике"
        color: GOLD_COLOR
        score: 340

    "sbory:participant":
        text: "сб"
        title: "Участник сборов кандидатов в сборную России на Международную олимпиаду школьников по информатике"
        color: PARTICIPANT_COLOR
        score: 270

    "ioi:participant":
        text: "ioi"
        title: "Участник Международной олимпиады школьников по информатике"
        color: PARTICIPANT_COLOR
        score: 290
    "ioi:3":
        text: "🥉ioi"
        title: "Бронзовая медаль на Международной олимпиады школьников по информатике"
        color: BRONZE_COLOR
        score: 300
    "ioi:2":
        text: "🥈ioi"
        title: "Серебряная медаль на Международной олимпиады школьников по информатике"
        color: SILVER_COLOR
        score: 310
    "ioi:1":
        text: "🥇ioi"
        title: "Золотая медаль на Международной олимпиады школьников по информатике"
        color: GOLD_COLOR
        score: 330
    "ioi:win":
        text: "🏆ioi"
        title: "Абсолютный победитель Международной олимпиады школьников по информатике"
        color: GOLD_COLOR
        score: 350

    #--------------------

    "git:1":
        text: "git"
        title: "Автор части кода на алгопроге (есть хотя бы один коммит в git)"
        color: PARTICIPANT_COLOR
        score: 38
    "git:3":
        text: "git"
        title: "Автор части кода на алгопроге (есть хотя бы три существенных коммита в git)"
        color: BRONZE_COLOR
        score: 67
    "git:5":
        text: "git"
        title: "Автор части кода на алгопроге (есть хотя бы пять существенных коммитов в git)"
        color: SILVER_COLOR
        score: 95
    "git:7":
        text: "git"
        title: "Автор части кода на алгопроге (есть хотя бы семь существенных коммитов в git)"
        color: GOLD_COLOR
        score: 135

    #-----------------

    "fullcontests:3":
        text: "full"
        title: "Три полностью решенных контеста"
        color: PARTICIPANT_COLOR
        score: 15
    "fullcontests:6":
        text: "full"
        title: "Шесть полностью решенных контестов"
        color: BRONZE_COLOR
        score: 33
    "fullcontests:15":
        text: "full"
        title: "Пятнадцать полностью решенных контестов"
        color: SILVER_COLOR
        score: 57
    "fullcontests:30":
        text: "full"
        title: "Тридцать полностью решенных контестов"
        color: GOLD_COLOR
        score: 87

    "clearcontests:1":
        text: "+"
        title: "Контест, в каждом из которых все задачи решены с первой попытки"
        color: PARTICIPANT_COLOR
        score: 17
    "clearcontests:2":
        text: "+"
        title: "Два контеста, в каждом из которых все задачи решены с первой попытки"
        color: BRONZE_COLOR
        score: 35
    "clearcontests:4":
        text: "+"
        title: "Четыре контеста, в каждом из которых все задачи решены с первой попытки"
        color: SILVER_COLOR
        score: 55
    "clearcontests:7":
        text: "+"
        title: "Семь контестов, в каждом из которых все задачи решены с первой попытки"
        color: GOLD_COLOR
        score: 85

    "plusone:2":
        text: "+1"
        title: "Два контеста, в каждом из которых все задачи решены с первой или со второй попытки (не считая контестов, где все задачи решены с первой попытки)"
        color: PARTICIPANT_COLOR
        score: 24
    "plusone:4":
        text: "+1"
        title: "Четыре контеста, в каждом из которых все задачи решены с первой или со второй попытки (не считая контестов, где все задачи решены с первой попытки)"
        color: BRONZE_COLOR
        score: 34
    "plusone:8":
        text: "+1"
        title: "Восемь контестов, в каждом из которых все задачи решены с первой или со второй попытки (не считая контестов, где все задачи решены с первой попытки)"
        color: SILVER_COLOR
        score: 54
    "plusone:14":
        text: "+1"
        title: "Четырнадцать контестов, в каждом из которых все задачи решены с первой или со второй попытки (не считая контестов, где все задачи решены с первой попытки)"
        color: GOLD_COLOR
        score: 84

    "cf:part":
        text: "cf"
        title: "Написан хотя бы один контест на Codeforces"
        color: PARTICIPANT_COLOR
        score: 37
    "cf:1500":
        text: "cf"
        title: "Рейтинг на cf минимум 1500"
        color: BRONZE_COLOR
        score: 75
    "cf:1700":
        text: "cf"
        title: "Рейтинг на cf минимум 1700"
        color: SILVER_COLOR
        score: 125
    "cf:1900":
        text: "cf"
        title: "Рейтинг на cf минимум 1900"
        color: GOLD_COLOR
        score: 235

    "a:3":
        text: "А"
        title: "Активность когда-то была 3"
        color: PARTICIPANT_COLOR
        score: 27
    "a:6":
        text: "А"
        title: "Активность когда-то была 6 и при этом уровень был минимум 1Б"
        color: BRONZE_COLOR
        score: 36
    "a:10":
        text: "А"
        title: "Активность когда-то была 10 и при этом уровень был минимум 2"
        color: SILVER_COLOR
        score: 43
    "a:15":
        text: "А"
        title: "Активность когда-то была 15 и при этом уровень был минимум 3"
        color: GOLD_COLOR
        score: 53
